source/AS4/Eu.EDelivery.AS4.UnitTests/Resources/as4_soapattachment.as4

<?xml version="1.0" encoding="UTF-8" standalone="no"?><S12:Envelope xmlns:S12="http://www.w3.org/2003/05/soap-envelope"><S12:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" S12:mustUnderstand="false"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-2b32282b-11ba-4ecc-a2b2-6fe949de7ae1">MIICszCCAZsCBFh/Pa4wDQYJKoZIhvcNAQELBQAwHjELMAkGA1UEBhMCQVQxDzANBgNVBAMMBnBo&#13;
LWFzNDAeFw0xNzAxMTgxMDA0MzBaFw00NDA2MDQxMDA0MzBaMB4xCzAJBgNVBAYTAkFUMQ8wDQYD&#13;
VQQDDAZwaC1hczQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCkSXJzCfwJByzu5wmM&#13;
lMaIG/MwCPSEupicpEWS5/y90s45ZI0TPivF2nf0booZj38qv37bMHBTtfhNUeWcqgZm/PIdWe/O&#13;
BVa+sAS7JW7DO1dvTRN8pYaCB8IWqp2IQAMJhDVpC827C4V4ynmd9qEHMYlFbHuFDP7dtU7sI8Lm&#13;
JJ9yUS3uy+aVaAkqy5Kqiyim2/bT0NHfpqhfQYV8kf0CDtPXSLf0vAS10jG4uY2Xv4MRJI0TTXOM&#13;
5w7fRw/hQhaVhuHZYRnSdC5xhuVvzynBjwnLIvlgVnYbto2hcBd6WqshvhZY3FkeirrxZbZ3XC9s&#13;
44Ru2xdXO5uGnavLKG59AgMBAAEwDQYJKoZIhvcNAQELBQADggEBACLwYzI62R0voLCbRZ3LKny1&#13;
ZsYY/qBuRXYmdQAJEAdEpmEKHgJk6vUhE8zP1M1UJJV15A2mdm23nWYGND49WufYLWnCne/mRSC3&#13;
HnJUctWO/Dp/lsMTgzVyRW+K0crA5kV6r4XSgZAQXJcqBZy1Fi8mGH2BCpmi09dJ13ae+ZnsNqRy&#13;
ZFubYRjOjSKoTfWgaaawJnq9++dQQAFIR/b8mRam38mhiLkZaYFb+EQS3gDD5+3ULcAWIzTRh8d1&#13;
Prv/wcBs3eI84uuPWvnYw08J9LkObQBXqV35ZrqTEyMBmpAn5xS1h4q8AXSkF23Hdq7p9ounk90q&#13;
Amw6eGzbVgILrg0=</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-0dc02380-bd17-423a-8b67-5dbac38556c0"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="S12"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/><ds:Reference URI="#id-e3af5f59-67b4-4280-941b-eca8560fbec4"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>qc7EiiUBrZnamtEOj/fcm5STMSQVEVuWm9sAYMXTj00=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>ntZzgldwJENMq2qcSdbUTSjmDZTuX8STPtweHxB4IjmQ73vhqf/AzDb+Kyv7FYqlQ4UasI7A53IQ&#13;
Q5nQ0zQVcNg29uyGNVO9a5/AQhajAODs7makZqQdyMEAdNZytsWELZJjHasMwpuC1UWvxwr+PueC&#13;
4swEHPNDJrRWQ4fbRTEPRlTzKTaOYVmM7QK0XcT85HF/OOf7Uzzkn/eMGzKveX1d/coW0ReR8kYa&#13;
RAdvXuOiAUlC0JMjtYg/ZBamIZCE9l/5JRfUdeTeRxsSxw50qOpFh2S2EUSQcOEq33mJbXnVXNs3&#13;
HxV39tTSyWSdSyLSPz0MIl2ScRSDuAEPbdh2Zw==</ds:SignatureValue><ds:KeyInfo Id="KI-c58e54a1-21c8-4d23-82b2-25f89754a946"><wsse:SecurityTokenReference wsu:Id="STR-9eae9111-2917-41c8-9cbb-1c680e2a1dc5"><wsse:Reference URI="#X509-2b32282b-11ba-4ecc-a2b2-6fe949de7ae1" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security><eb:Messaging xmlns:S11="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:eb="http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/" xmlns:ebbp="http://docs.oasis-open.org/ebxml-bp/ebbp-signals-2.0" xmlns:xlink="http://www.w3.org/1999/xlink" S12:mustUnderstand="true"><eb:UserMessage><eb:MessageInfo><eb:Timestamp>2017-09-14T15:07:00.088</eb:Timestamp><eb:MessageId>ph-as4@491b3a39-076d-4f43-8a01-1ca99c085d62</eb:MessageId></eb:MessageInfo><eb:PartyInfo><eb:From><eb:PartyId>ph-as4-sender</eb:PartyId><eb:Role>http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/sender</eb:Role></eb:From><eb:To><eb:PartyId>ph-as4-receiver</eb:PartyId><eb:Role>http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/responder</eb:Role></eb:To></eb:PartyInfo><eb:CollaborationInfo><eb:AgreementRef pmode="CEF-Initiator-CEF-Responder">urn:as4:agreements:so-that-we-have-a-non-empty-value</eb:AgreementRef><eb:Service type="MyServiceTypes">SRV_SIMPLE_ONEWAY_DYN</eb:Service><eb:Action>ACT_SIMPLE_ONEWAY_DYN</eb:Action><eb:ConversationId>4321</eb:ConversationId></eb:CollaborationInfo><eb:MessageProperties><eb:Property name="originalSender">C1-test</eb:Property><eb:Property name="finalRecipient">C4-test</eb:Property><eb:Property name="trackingidentifier">tracker</eb:Property></eb:MessageProperties><eb:PayloadInfo><eb:PartInfo href=""/></eb:PayloadInfo></eb:UserMessage></eb:Messaging></S12:Header><S12:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-e3af5f59-67b4-4280-941b-eca8560fbec4"><StandardBusinessDocument xmlns="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <StandardBusinessDocumentHeader>
    <HeaderVersion>1.0</HeaderVersion>
    <Sender>
      <Identifier Authority="iso6523-actorid-upis">9915:test</Identifier>
    </Sender>
    <Receiver>
      <Identifier Authority="iso6523-actorid-upis">9915:test</Identifier>
    </Receiver>
    <DocumentIdentification>
      <Standard>urn:oasis:names:specification:ubl:schema:xsd:Invoice-2</Standard>
      <TypeVersion>2.1</TypeVersion>
      <InstanceIdentifier>123123</InstanceIdentifier>
      <Type>Invoice</Type>
      <CreationDateAndTime>2013-02-19T05:10:10Z</CreationDateAndTime>
    </DocumentIdentification>
    <BusinessScope>
      <Scope>
        <Type>DOCUMENTID</Type>
        <InstanceIdentifier>urn:oasis:names:specification:ubl:schema:xsd:Invoice-2::Invoice##urn:www.cenbii.eu:transaction:biitrns010:ver2.0:extended:urn:www.peppol.eu:bis:peppol4a:ver2.0::2.1</InstanceIdentifier>
      </Scope>
      <Scope>
        <Type>PROCESSID</Type>
        <InstanceIdentifier>urn:www.cenbii.eu:profile:bii04:ver1.0</InstanceIdentifier>
      </Scope>
    </BusinessScope>
  </StandardBusinessDocumentHeader>
  <Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2">
    <cbc:UBLVersionID>2.1</cbc:UBLVersionID>
    <cbc:CustomizationID schemeID="PEPPOL">
urn:www.cenbii.eu:transaction:biicoretrdm010:ver1.0:#urn:www.peppol.eu:bis:peppol4a:ver1.0
</cbc:CustomizationID>
    <cbc:ProfileID>urn:www.cenbii.eu:profile:bii04:ver1.0</cbc:ProfileID>
    
    
    <cbc:ID>ERB_UBL_INVOICE_001</cbc:ID>
    <cbc:IssueDate>2017-01-01</cbc:IssueDate>
    <cbc:InvoiceTypeCode>380</cbc:InvoiceTypeCode>
    <cbc:Note>Das ist ein globaler Kommentar zur Rechnung.</cbc:Note>
    <cbc:Note>
Das ist die zweite Zeile des Kommentars. Auch Zeilenumbrüche in einer Note werden berücksichtigt.
</cbc:Note>
    <cbc:DocumentCurrencyCode>EUR</cbc:DocumentCurrencyCode>
    <cac:OrderReference>
      
      
      <cbc:ID>Z01</cbc:ID>
    </cac:OrderReference>
    <cac:AccountingSupplierParty>
      
      
      <cbc:CustomerAssignedAccountID>11011011</cbc:CustomerAssignedAccountID>
      <cac:Party>
        <cac:PartyName>
          <cbc:Name>Mustermann GmbH</cbc:Name>
        </cac:PartyName>
        <cac:PostalAddress>
          <cbc:StreetName>Hauptstraße</cbc:StreetName>
          <cbc:BuildingNumber>10</cbc:BuildingNumber>
          <cbc:CityName>Graz</cbc:CityName>
          <cbc:PostalZone>8010</cbc:PostalZone>
          <cac:Country>
            <cbc:IdentificationCode>AT</cbc:IdentificationCode>
          </cac:Country>
        </cac:PostalAddress>
        <cac:PartyTaxScheme>
          <cbc:CompanyID>ATU13585627</cbc:CompanyID>
          <cac:TaxScheme>
            <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5153">VAT</cbc:ID>
          </cac:TaxScheme>
        </cac:PartyTaxScheme>
        <cac:Contact>
          <cbc:Telephone>1234 567890</cbc:Telephone>
          
          
          <cbc:ElectronicMail>martin.bayerl@brz.gv.at</cbc:ElectronicMail>
        </cac:Contact>
        <cac:Person>
          <cbc:FirstName>Max</cbc:FirstName>
          <cbc:FamilyName>Mustermann</cbc:FamilyName>
        </cac:Person>
      </cac:Party>
    </cac:AccountingSupplierParty>
    <cac:AccountingCustomerParty>
      
      
      <cbc:SupplierAssignedAccountID>149</cbc:SupplierAssignedAccountID>
      <cac:Party>
        <cac:PartyName>
          <cbc:Name>BRZ GmbH</cbc:Name>
        </cac:PartyName>
        <cac:PostalAddress>
          <cbc:StreetName>Hintere Zollamtsstraße</cbc:StreetName>
          <cbc:BuildingNumber>4</cbc:BuildingNumber>
          <cbc:CityName>Wien</cbc:CityName>
          <cbc:PostalZone>1030</cbc:PostalZone>
          <cac:Country>
            <cbc:IdentificationCode>AT</cbc:IdentificationCode>
          </cac:Country>
        </cac:PostalAddress>
        <cac:PartyTaxScheme>
          <cbc:CompanyID>ATU 378 664 03</cbc:CompanyID>
          <cac:TaxScheme>
            <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5153">VAT</cbc:ID>
          </cac:TaxScheme>
        </cac:PartyTaxScheme>
        <cac:Contact>
          <cbc:Telephone>+43 / 1 / 78 56 789</cbc:Telephone>
          <cbc:ElectronicMail>support-erb@brz.gv.at; info@brz.gv.at</cbc:ElectronicMail>
        </cac:Contact>
        <cac:Person>
          <cbc:FirstName>Maxime</cbc:FirstName>
          <cbc:FamilyName>Musterfrau</cbc:FamilyName>
        </cac:Person>
      </cac:Party>
    </cac:AccountingCustomerParty>
    <cac:Delivery>
      
      
      <cbc:ActualDeliveryDate>2012-11-18</cbc:ActualDeliveryDate>
      <cac:DeliveryLocation>
        <cac:Address>
          <cbc:StreetName>Hintere Zollamtsstraße</cbc:StreetName>
          <cbc:BuildingNumber>4</cbc:BuildingNumber>
          <cbc:CityName>Wien</cbc:CityName>
          <cbc:PostalZone>1030</cbc:PostalZone>
          <cac:Country>
            <cbc:IdentificationCode>AT</cbc:IdentificationCode>
          </cac:Country>
        </cac:Address>
      </cac:DeliveryLocation>
    </cac:Delivery>
    <cac:PaymentMeans>
      
      <cbc:PaymentMeansCode>31</cbc:PaymentMeansCode>
      
      
      <cbc:PaymentDueDate>2017-12-31</cbc:PaymentDueDate>
      <cbc:PaymentChannelCode>IBAN</cbc:PaymentChannelCode>
      <cbc:InstructionNote>Sofort fällig</cbc:InstructionNote>
      <cac:PayeeFinancialAccount>
        <cbc:ID schemeID="IBAN">AT611904300234573201</cbc:ID>
        <cac:FinancialInstitutionBranch>
          <cac:FinancialInstitution>
            <cbc:ID schemeID="BIC">TUVTAT21</cbc:ID>
          </cac:FinancialInstitution>
        </cac:FinancialInstitutionBranch>
      </cac:PayeeFinancialAccount>
    </cac:PaymentMeans>
    <cac:PaymentTerms>
      
      
      <cbc:ID>1</cbc:ID>
      <cbc:Note>
3% Skonto bei Zahlung in 5 Tagen/3% discount when paid in 5 days
</cbc:Note>
      <cbc:SettlementDiscountPercent>3.00</cbc:SettlementDiscountPercent>
      <cac:SettlementPeriod>
        <cbc:StartDate>2017-01-01</cbc:StartDate>
        <cbc:EndDate>2017-12-30</cbc:EndDate>
      </cac:SettlementPeriod>
    </cac:PaymentTerms>
    <cac:AllowanceCharge>
      
      
      <cbc:ChargeIndicator>true</cbc:ChargeIndicator>
      <cbc:Amount currencyID="EUR">14.50</cbc:Amount>
      <cac:TaxCategory>
        <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5305">AA</cbc:ID>
        <cbc:Percent>20</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5153">VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:AllowanceCharge>
    <cac:AllowanceCharge>
      
      
      <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
      <cbc:Amount currencyID="EUR">0.13</cbc:Amount>
      <cac:TaxCategory>
        <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5305">AA</cbc:ID>
        <cbc:Percent>20</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5153">VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:AllowanceCharge>
    <cac:TaxTotal>
      <cbc:TaxAmount currencyID="EUR">30</cbc:TaxAmount>
      <cac:TaxSubtotal>
        <cbc:TaxableAmount currencyID="EUR">150</cbc:TaxableAmount>
        <cbc:TaxAmount currencyID="EUR">30</cbc:TaxAmount>
        <cac:TaxCategory>
          <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5305">S</cbc:ID>
          <cbc:Percent>20</cbc:Percent>
          <cac:TaxScheme>
            <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5153">VAT</cbc:ID>
          </cac:TaxScheme>
        </cac:TaxCategory>
      </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:LegalMonetaryTotal>
      <cbc:LineExtensionAmount currencyID="EUR">135.63</cbc:LineExtensionAmount>
      <cbc:TaxExclusiveAmount currencyID="EUR">135.63</cbc:TaxExclusiveAmount>
      <cbc:TaxInclusiveAmount currencyID="EUR">162.76</cbc:TaxInclusiveAmount>
      <cbc:PayableAmount currencyID="EUR">180</cbc:PayableAmount>
    </cac:LegalMonetaryTotal>
    <cac:InvoiceLine>
      <cbc:ID>1</cbc:ID>
      <cbc:InvoicedQuantity unitCode="LH">1</cbc:InvoicedQuantity>
      <cbc:LineExtensionAmount currencyID="EUR">135.63</cbc:LineExtensionAmount>
      <cac:OrderLineReference>
        
        
        <cbc:LineID>10</cbc:LineID>
      </cac:OrderLineReference>
      <cac:TaxTotal>
        <cbc:TaxAmount currencyID="EUR">27.13</cbc:TaxAmount>
        <cac:TaxSubtotal>
          <cbc:TaxableAmount currencyID="EUR">135.63</cbc:TaxableAmount>
          <cbc:TaxAmount currencyID="EUR">27.13</cbc:TaxAmount>
          <cac:TaxCategory>
            <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5305">S</cbc:ID>
            <cbc:Percent>20</cbc:Percent>
            <cac:TaxScheme>
              <cbc:ID schemeAgencyID="6" schemeID="UN/ECE 5153">VAT</cbc:ID>
            </cac:TaxScheme>
          </cac:TaxCategory>
        </cac:TaxSubtotal>
      </cac:TaxTotal>
      <cac:Item>
        <cbc:Description>Abrechnung</cbc:Description>
        <cbc:Name>Abrechnung</cbc:Name>
      </cac:Item>
      <cac:Price>
        <cbc:PriceAmount currencyID="EUR">1085.00</cbc:PriceAmount>
        <cbc:BaseQuantity unitCode="LH">8</cbc:BaseQuantity>
      </cac:Price>
    </cac:InvoiceLine>
  </Invoice>
</StandardBusinessDocument></S12:Body></S12:Envelope>